<?php
// zamatura.eu/proizvedeniq
	$authors = [];

	$authors[] = "Христо Ботев";//       0
	$authors[] = "Иван Вазов";//         1
	$authors[] = "Алеко Константинов";// 2
	$authors[] = "Пенчо Славейков";//    3
	$authors[] = "Пейо Яворов"; //       4
	$authors[] = "Димчо Дебелянов";//    5
	$authors[] = "Гео Милев";//          6
	$authors[] = "Елин Пелин";//         7
	$authors[] = "Йордан Йовков";//      8
	$authors[] = "Христо Смирненски";//  9
	$authors[] = "Елисавета Багряна";// 10
	$authors[] = "Атанас Далчев";//     11
	$authors[] = "Димитър Талев";//     12
	$authors[] = "Димитър Димов";//     13
	$authors[] = "Никола Вапцаров";//   14

	$works = [];
	//Христо Ботев
	//0 - 8
	$works[] = ["Майце си",0,"елегия"];    
	$works[] = ["Към брата си",0,"елегия"];
	$works[] = ["Борба",0,"елегия"];
	$works[] = ["Елегия",0,"елегия"];
	$works[] = ["На прощаване в 1868г.",0,"поема"];
	$works[] = ["До моето първо либе",0,"елегия"];
	$works[] = ["Хаджи Димитър",0,"балада"];
	$works[] = ["Обесването на Васил Левски",0,"елегия"];
	$works[] = ["Моята молитва",0,"елегия"];

	//Иван Вазов
	//9 - 20
	$works[] = ["Българският език",1,"ода"];
	$works[] = ["Опълченците на Шипка",1,"ода"];
	$works[] = ["При Рилския манастир",1,"стихотворение"];
	$works[] = ["Чичовци",1,"повест"];
	$works[] = ["Под игото",1,"роман"];
	$works[] = ["Дядо Йоцо гледа",1,"разказ"];
	$works[] = ["Кочо",1,"ода"];
	$works[] = ["Паисий",1,"ода"];
	$works[] = ["Отечество любезно",1,"стихотворение"];
	$works[] = ["Елате ни вижте",1,"елегия"];
	$works[] = ["Линее нашто поколенье",1,"сатира"];
	$works[] = ["Левски",1,"ода"];

	//Алеко Константинов
	//21 - 22
	$works[] = ["Бай Ганьо",2,"книга"];
	$works[] = ["Разни хора, разни идеали",2,"цикъл от фейлетони"];

	//Пенчо Славейков
	//23 - 27
	$works[] = ["Cis Moll",3,"поема"];
	$works[] = ["Ни лъх не дъхва над полени",3,"лирическа миниатюра"];
	$works[] = ["Спи езерото",3,"лирическа миниатюра"];
	$works[] = ["Самотен гроб в самотен кът",3,"лирическа миниатюра"];
	$works[] = ["Ралица",3,"поема"];
	//Пейо Яворов
	//28 - 36
	$works[] = ["Градушка",4,"поема"];
	$works[] = ["Стон",4,"стихотворение"];
	$works[] = ["Сенки",4,"стихотворение"];
	$works[] = ["Заточеници",4,"елегия"];
	$works[] = ["Две души",4,"стихотворение"];
	$works[] = ["Маска",4,"стихотворение"];
	$works[] = ["Ще бъдеш в бяло",4,"стихотворение"];
	$works[] = ["Две хубави очи",4,"стихотворение"];
	$works[] = ["Песента на човека",4,"стихотворение"];

	//Димчо Дебелянов
	//37 - 45
	$works[] = ["Спи градът",5,"елегия"];
	$works[] = ["Пловдив",5,"сонет"];
	$works[] = ["Тиха победа",5,"елегия"];
	$works[] = ["Черна песен",5,"елегия"];
	$works[] = ["Да се завърнеш..",5,"елегия"];
	$works[] = ["Помниш ли, помниш ли..",5,"елегия"];
	$works[] = ["Миг",5,"елегия"];
	$works[] = ["Сиротна песен",5,"елегия"];
	$works[] = ["Един убит",5,"елегия"];

	//Гео Милев
	//46 - 46
	$works[] = ["Септември",6,"поема"];
	
	//Елин Пелин
	//47 - 55
	$works[] = ["Гераците",7,"повест"];
	$works[] = ["Косачи",7,"разказ"];
	$works[] = ["Задушница",7,"разказ"];
	$works[] = ["Ветрената мелница",7,"разказ"];
	$works[] = ["Андрешко",7,"разказ"];
	$works[] = ["Чорба от греховете на отец Никодим",7,"разказ"];
	$works[] = ["Занемелите камбани",7,"разказ"];
	$works[] = ["Мечтатели",7,"разказ"];
	$works[] = ["На оня свят",7,"разказ"];
	
	//Йордан Йовков
	//56 - 63
	$works[] = ["Серафим",8,"разказ"];
	$works[] = ["Последна радост",8,"разказ"];
	$works[] = ["Шибил",8,"разказ"];
	$works[] = ["През чумавото",8,"разказ"];
	$works[] = ["Индже",8,"разказ"];
	$works[] = ["Албена",8,"разказ"];
	$works[] = ["Другоселец",8,"разказ"];
	$works[] = ["Песента на колелетата",8,"разказ"];

	//Христо Смирненски
	//64 - 70
	$works[] = ["Ний",9,"стихотворение"];
	$works[] = ["Да бъде ден",9,"стихотворение"];
	$works[] = ["Йохан",9,"поема"];
	$works[] = ["Юноша",9,"стихотворение"];
	$works[] = ["Старият музикант",9,"стихотворение"];
	$works[] = ["Цветарка",9,"стихотворение"];
	$works[] = ["Зимни вечери",9,"лирически цикъл"];

	//Елисавета Багряна
	//71 - 74
	$works[] = ["Стихии",10,"стихотворение"];
	$works[] = ["Потомка",10,"стихотворение"];
	$works[] = ["Кукувица",10,"стихотворение"];
	$works[] = ["Вечната",10,"стихотворение"];

	//Атанас Далчев
	//75 - 82 
	$works[] = ["Стаята",11,"стихотворение"];
	$works[] = ["Болница",11,"стихотворение"];
	$works[] = ["Книгите",11,"стихотворение"];
	$works[] = ["Камък",11,"стихотворение"];
	$works[] = ["Повест",11,"стихотворение"];
	$works[] = ["Дяволско",11,"стихотворение"];
	$works[] = ["Прозорец",11,"стихотворение"];
	$works[] = ["Къщата",11,"стихотворение"];

	//Димитър Талев
	//83 - 83
	$works[] = ["Железният светилник",12,"роман"];

	//Димитър Димов
	//84 - 84
	$works[] = ["Тютюн",13,"роман"];

	//Никола Вапцаров
	//85 - 93
	$works[] = ["Вяра",14,"стихотворение"];
	$works[] = ["Писмо",14,"стихотворение"];
	$works[] = ["Песен за човека",14,"стихотворение"];
	$works[] = ["Прощално",14,"стихотворение"];
	$works[] = ["Сън",14,"стихотворение"];
	$works[] = ["История",14,"стихотворение"];
	$works[] = ["Кино",14,"стихотворение"];
	$works[] = ["Завод",14,"стихотворение"];
	$works[] = ["Борбата е безмилостно жестока",14,"стихотворение"];
	
	$chars = [];
	//"Чичовци"
	$chars[] = ["Варлаам Копринарката",12];
	$chars[] = ["Иван Селямсъзът",12];
	$chars[] = ["господин Фратю",12];
	$chars[] = ["Иванчо Йотата",12];
	$chars[] = ["хаджи Смион",12];
	$chars[] = ["Мирончо",12];
	$chars[] = ["поп Ставри",12];
	$chars[] = ["учител Гатю",12];
	$chars[] = ["подидаскал Мироновски",12];
	$chars[] = ["Мичо Бейзадето",12];
	$chars[] = ["беят",12];
	$chars[] = ["Мексиканеца",12];

	//"Под игото"
	$chars[] = ["Бойчо Огнянов",13];
	$chars[] = ["д-р Соколов",13];
	$chars[] = ["Кандов",13];
	$chars[] = ["Рада Госпожина",13];
	$chars[] = ["чорбаджи Марко Иванов",13];
	$chars[] = ["дядо Стоян",13];
	$chars[] = ["Марийка",13];
	$chars[] = ["дякон Викентий",13];
	$chars[] = ["отец Йеротей",13];
	$chars[] = ["игумен Натанаил",13];
	$chars[] = ["Иван Боримечката",13];
	$chars[] = ["Станка",13];
	$chars[] = ["дядо Стойко",13];
	$chars[] = ["Петър",13];
	$chars[] = ["кака Гинка",13];
	$chars[] = ["Лалка",13];
	$chars[] = ["Колчо",13];
	$chars[] = ["Милка Тодоричина",13];
	$chars[] = ["Мунчо",13];
	$chars[] = ["Христаки Заманов",13];
	$chars[] = ["Безпортев",13];
	$chars[] = ["чорбаджи Юрдан Диамандиев",13];
	$chars[] = ["Кириак Стефчов",13];
	$chars[] = ["госпожа Хаджи Ровоама",13];
	$chars[] = ["Шериф ага",13];
	$chars[] = ["Тосун бей",13];
	$chars[] = ["Емексиз Пехливан",13];
	$chars[] = ["Клеопатра",13];
	
	//"Бай Ганьо"
	$chars[] = ["Иваница Граматиков",21];
	$chars[] = ["професор Иречек",21];
	$chars[] = ["Стати",21];
	$chars[] = ["Стойчо",21];
	$chars[] = ["Кольо",21];
	$chars[] = ["Цвятко",21];
	$chars[] = ["Илчо",21];
	$chars[] = ["Марк Аврелий",21];
	$chars[] = ["Арпакаш",21];
	$chars[] = ["Амонасро Етиопский",21];
	$chars[] = ["Ожилката",21];
	$chars[] = ["адвокат Гуньо Килипирчиков",21];
	$chars[] = ["бай Михал",21];
	$chars[] = ["Бочоолу",21];
	$chars[] = ["Гочоолу",21];
	$chars[] = ["Дочоолу",21];
	$chars[] = ["Данко Харсъзина",21];

	//"Разни хора, разни идеали"
	$chars[] = ["амнистираният престъпник",22];
	$chars[] = ["псевдопатриотът",22];
	$chars[] = ["помощник- регистраторът",22];
	$chars[] = ["чичото еснаф",22];
	$chars[] = ["племенникът ветрогонец",22];

	//"Cis Moll"
	$chars[] = ["Бетовен",23];
	
	//"Ралица"
	$chars[] = ["Ралица",27];
	$chars[] = ["Иво Бойкин",27];
	$chars[] = ["Стоичко Влаха",27];

	//"Градушка"
	$chars[] = ["Иванчо",28];

	//"Маска"
	$chars[] = ["вакханката",33];

	//"Септември"
	$chars[] = ["поп Андрей",46];
	$chars[] = ["капитана",46];

	//"Гераците"
	$chars[] = ["дядо Йордан Герака",47];
	$chars[] = ["баба Марга",47];
	$chars[] = ["Божан",47];
	$chars[] = ["Петър",47];
	$chars[] = ["Павел",47];
	$chars[] = ["Елка",47];
	$chars[] = ["Захаринчо",47];
	$chars[] = ["Йовка",47];
	$chars[] = ["дядо Матей Маргалака",47];
	
	//"Косачи"
	$chars[] = ["Лазо",48];
	$chars[] = ["Благолажа",48];
	$chars[] = ["Стамо",48];
	$chars[] = ["Пенка",48];

	//"Задушница"
	$chars[] = ["Станчо",49];
	$chars[] = ["Стоилка",49];
	$chars[] = ["Дивдена",49];
	$chars[] = ["Божана - жена на Станчо",49];

	//"Ветрената мелница"
	$chars[] = ["дядо Корчан",50];
	$chars[] = ["Лазар Дъбака",50];
	$chars[] = ["Христина",50];

	//"Андрешко"
	$chars[] = ["съдия-изпълнителят",51];
	$chars[] = ["Станойчо / Станоя",51];
	
	//"Чорба от грехове на отец Никодим"
	$chars[] = ["отец Сисой",52];
	$chars[] = ["отец Никодим",52];
	//"Занемели камбани"
	$chars[] = ["отец Йоаким",53];
	$chars[] = ["просякинята",53];
	//"Мечтатели"
	$chars[] = ["чичо Горан",54];
	$chars[] = ["Рустем",54];
	$chars[] = ["Акима",54];
	//"На оня свят"
	$chars[] = ["дядо Матейко",55];
	$chars[] = ["баба Йова",55];
	$chars[] = ["св. Петър",55];
	$chars[] = ["ангелчето",55];
	$chars[] = ["баба Матейца ( Трена )",55];

	//"Серафим"
	$chars[] = ["Еню",56];
	$chars[] = ["Павлина",56];

	//"Последна радост"
	$chars[] = ["Люцкан",57];
	$chars[] = ["Цветана",57];
	$chars[] = ["инженерът",57];
	$chars[] = ["Митю Караколев",57];
	$chars[] = ["дядо Слави",57];
	$chars[] = ["Кръстан Касапина",57];
	$chars[] = ["Рачо Самсарът",57];

	//"Шибил"
	$chars[] = ["Мурад бей",58];
	$chars[] = ["Велико кехая",58];
	$chars[] = ["Мустафа",58];

	//"През чумавото"
	$chars[] = ["Хаджи Драган",59];
	$chars[] = ["Величко",59];
	$chars[] = ["Тиха",59];
	$chars[] = ["Дочка",59];
	
	//"Индже"
	$chars[] = ["Индже",60];
	$chars[] = ["Пауна",60];
	$chars[] = ["дядо Гуди",60];
	$chars[] = ["Кара Кольо",60];
	$chars[] = ["Сяро Барутчията",60];
	$chars[] = ["Найден",60];
	$chars[] = ["баба Яна Калмучката",60];
	
	//"Албена"
	$chars[] = ["Албена",61];
	$chars[] = ["Куцар",61];
	$chars[] = ["Нягул",61];
	$chars[] = ["Нягулица",61];
	$chars[] = ["дядо Власю",61];
	
	//"Другоселец"
	$chars[] = ["кметът Алекси",62];
	$chars[] = ["Татар Христо",62];
	$chars[] = ["Торашко",62];

	//"Песента на колелетата"
	$chars[] = ["Сали Яшар",63];
	$chars[] = ["Джапар",63];
	$chars[] = ["Шакире",63];

	//"Йохан"
	$chars[] = ["хусаря",66];

	//"Цветарка"
	$chars[] = ["оркестърът",69];

	//"Вечната"
	$chars[] = ["Ана; Мария",74];

	//"Железният светилник"
	$chars[] = ["Стоян Глаушев",83];
	$chars[] = ["Султана",83];
	$chars[] = ["Кочо ( проза )",83];
	$chars[] = ["Лазар",83];
	$chars[] = ["Катерина",83];
	$chars[] = ["Ния",83];
	$chars[] = ["Вуйко Тасев",83];
	$chars[] = ["Манда",83];
	$chars[] = ["Нона",83];
	$chars[] = ["Божана - приятелка на Лазар",83];
	$chars[] = ["Аврам Немтур",83];
	$chars[] = ["Климент Бенков",83];
	$chars[] = ["Андреа Бенков",83];
	$chars[] = ["Рафе Клинче",83];
	$chars[] = ["Стойна",83];
	$chars[] = ["рилския монах",83];
	$chars[] = ["владишкия наместник",83];

	//"Тютюн"
	$chars[] = ["Борис",84];
	$chars[] = ["Ирина",84];
	$chars[] = ["Мария",84];
	$chars[] = ["Павел Морев",84];
	$chars[] = ["Лила",84];
	$chars[] = ["Стефан",84];
	$chars[] = ["Динко",84];
	$chars[] = ["Костов",84];
	$chars[] = ["фон Гайер",84];
	$chars[] = ["Лихтенфелд",84];
	$chars[] = ["Прайбиш",84];
	$chars[] = ["Редингота",84];
	$chars[] = ["Чакъра",84];
	$chars[] = ["Зара",84];
	$chars[] = ["татко Пиер",84];
	$chars[] = ["Шишко",84];
	$chars[] = ["Спасуна",84];
	$chars[] = ["Варвара",84];
	$chars[] = ["Бимби",84];
	$chars[] = ["Барутчиев",84];
	$chars[] = ["Фитилчето",84];
	$chars[] = ["Макс Ешкенази",84];

	//"Сън"
	$chars[] = ["Лори",89];
	$chars[] = ["Фернандес",89];

	//"Кино"
	$chars[] = ["Джон",91];
	$chars[] = ["Грета",91];
?>